libicu-devel
openssl-devel
openldap-devel
zlib-devel
libxslt-devel
libxml2-devel
readline-devel
pam-devel
python3-devel
tcl-devel
perl-devel
perl-ExtUtils-Embed
perl-ExtUtils-MakeMaker
lz4-devel
libzstd-devel
systemd-devel
libuuid-devel
libtool
e2fsprogs-devel
e2fsprogs
e2fsprogs-libs
libselinux-devel
llvm-devel
bc
